app/controllers/api/v1/users_controller.rb

      def login
        user = User.find_by(email: user_params[:email].to_s.downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test@test.ca"], ["LIMIT", 1]]

      def create
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?)

      def update
        if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "test"], ["password_digest", "$2a$10$9zRJ42GSYJXYOripN8rZoe5t/2bVfHGi3ydS/2hu0doqS2X/cTHJe"], ["updated_at", "2020-10-08 14:41:20.375267"], ["id", 1]]